day1/3_cavity2D/cavity2D/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets; // Type of sampling, sets will sample along a line.

setFormat raw;

//interpolationScheme cell;
//interpolationScheme cellPoint;
interpolationScheme cellPointFace; // location of the interpolation points

// Fields to sample.
fields
(
    U
);

sets
(

    l1
    {
        type            midPointAndFace; // How to interpolate the solution to the sample entity (line in this case)
        //type            midPoint;
        //type            face;

        //type            uniform;
	//nPoints 	  100;

        axis            x;
        start           ( -1  0.5 0);
        end             ( 2  0.5 0);
    }

    l2
    {
        type            midPointAndFace;
        //type            midPoint;
        //type            face;

        axis            y;
        start           (0.5 -1 0);
        end             (0.5 2 0);
    }

);

// *********************************************************************** //
